src/Catalogs/ar_Пресеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Пресеты</Name>
			<Comment>Реестр готовых конфигураций агентов (пресетов) для импорта в ar_Агенты. META-22.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_JSON</Name>
					<Comment>Сериализованная конфигурация агента. Без ключей и идентификаторов провайдеров.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Категория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИконкаИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникРасширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/ar_БиблиотекаПресетов/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Лицензия: MIT. Полный текст — в файле LICENSE в корне репозитория.
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Модуль формы ar_БиблиотекаПресетов (Agent Library).
//
// Общая форма-библиотека пресетов агентов. Предоставляет UI для просмотра,
// фильтрации и импорта готовых конфигураций агентов из справочника ar_Пресеты.
//
// Основные use-cases:
//   - Открытие и загрузка списка пресетов из БД
//   - Фильтрация по тексту, категории, признаку "только ядро"
//   - Импорт выбранного пресета в новый элемент ar_Агенты
//   - Открытие карточки пресета для просмотра JSON
//
// UI-17
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик создания формы на сервере.
// Загружает список пресетов и инициализирует фильтры.
//
// Параметры:
//   ОтказПриСозданиии - Булево - управление отказом от открытия.
//   СтандартнаяОбработка - Булево
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Попытка
		// Встроенные пресеты (макеты ar_Пресет_* обработки ar_ПресетыВстроенные)
		// живут в метаданных расширения, а не в справочнике. До UI-17 они
		// подключались только Мастером первичной настройки, который после
		// прохождения закрывается навсегда (ar_МастерНастройкиВыполнен) - в
		// результате встроенный пресет невозможно было подключить из UI вообще.
		// Синхронизируем их в справочник при каждом открытии библиотеки:
		// upsert по ar_Имя, идемпотентно, пользовательские пресеты не трогаются.
		СинхронизироватьВстроенныеПресеты();
		ЗагрузитьТаблицуПресетов();
		ЗаполнитьСписокКатегорий();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'AgentRunner.БиблиотекаПресетов'; en = 'AgentRunner.AgentLibrary'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

// Фильтрует таблицу при изменении поля поиска.
//
&НаКлиенте
Процедура ФильтрПоискПриИзменении(Элемент)
	ПрименитьФильтрНаСервере();
КонецПроцедуры

// Фильтрует таблицу при изменении категории.
//
&НаКлиенте
Процедура ФильтрКатегорияПриИзменении(Элемент)
	ПрименитьФильтрНаСервере();
КонецПроцедуры

// Фильтрует таблицу при изменении флага "только ядро".
//
&НаКлиенте
Процедура ФильтрТолькоЯдроПриИзменении(Элемент)
	ПрименитьФильтрНаСервере();
КонецПроцедуры

// Управляет доступностью кнопок при смене активной строки таблицы.
//
&НаКлиенте
Процедура ТаблицаПресетовЭлементПриАктивизацииСтроки(Элемент)
	СсылкаВыбрана = СсылкаВыбранногоПресета() <> Неопределено;
	УстановитьДоступностьКнопок(СсылкаВыбрана);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

// Импортирует выбранный пресет в новый элемент ar_Агенты.
//
&НаКлиенте
Процедура ИмпортироватьПресет(Команда)

	// Проверяем право создания агентов (только Админ - Plan §2.2)
	Если НЕ ЕстьПравоСозданияАгентаНаСервере() Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Недостаточно прав для создания агента. Обратитесь к администратору.';
			     |en = 'Insufficient rights to create an agent. Contact the administrator.'"));
		Возврат;
	КонецЕсли;

	СсылкаПресет = СсылкаВыбранногоПресета();
	Если СсылкаПресет = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РезультатИмпорта = ИмпортироватьПресетНаСервере(СсылкаПресет);
	ОбработатьРезультатИмпорта(РезультатИмпорта);

КонецПроцедуры

// Открывает карточку выбранного пресета в форме элемента.
//
&НаКлиенте
Процедура ОткрытьКарточкуПресета(Команда)

	СсылкаПресет = СсылкаВыбранногоПресета();
	Если СсылкаПресет = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура("Ключ", СсылкаПресет);
	ОткрытьФорму("Справочник.ar_Пресеты.ФормаЭлемента", ПараметрыОткрытия, ЭтотОбъект);

КонецПроцедуры

// Перезагружает список пресетов из БД.
//
&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Синхронизирует встроенные пресеты расширения (макеты ar_Пресет_* обработки
// ar_ПресетыВстроенные) в справочник ar_Пресеты.
//
// Зачем: макеты - это метаданные, а вся библиотека (фильтры, карточка, импорт
// в ar_Агенты) работает со справочником. Без синхронизации встроенный пресет
// виден только Мастеру первичной настройки, который после прохождения больше
// не открывается - и подключить пресет становится нечем.
//
// Идемпотентна: upsert по ar_Имя. Пресеты, созданные пользователем вручную
// (ar_ИсточникРасширение пуст), не затрагиваются - обновляются только записи,
// ранее заведённые этой же синхронизацией.
//
&НаСервере
Процедура СинхронизироватьВстроенныеПресеты()

	МетаОбработки = Метаданные.Обработки.Найти("ar_ПресетыВстроенные");
	Если МетаОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяРасширения = "AgentRunner";

	Для Каждого МетаМакета Из МетаОбработки.Макеты Цикл

		Если Не СтрНачинаетсяС(МетаМакета.Имя, "ar_Пресет_") Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ТекстJSON = Обработки.ar_ПресетыВстроенные.ПолучитьМакет(МетаМакета.Имя).ПолучитьТекст();
			Данные = ar_JSON.ИзJSON(ТекстJSON);
		Исключение
			// Битый макет не должен ронять всю библиотеку - пропускаем его.
			Продолжить;
		КонецПопытки;

		Если ТипЗнч(Данные) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;

		// Имя агента из блока agent.name, иначе имя макета.
		ИмяПресета = МетаМакета.Синоним;
		БлокАгента = Данные.Получить("agent");
		Если ТипЗнч(БлокАгента) = Тип("Соответствие")
			И Не ПустаяСтрока(БлокАгента.Получить("name")) Тогда
			ИмяПресета = СокрЛП(Строка(БлокАгента.Получить("name")));
		КонецЕсли;
		Если ПустаяСтрока(ИмяПресета) Тогда
			ИмяПресета = МетаМакета.Имя;
		КонецЕсли;

		СсылкаПресета = НайтиПресетПоИмени(ИмяПресета);

		Если ЗначениеЗаполнено(СсылкаПресета) Тогда
			ОбъектПресета = СсылкаПресета.ПолучитьОбъект();
			// Не перетираем пресет, заведённый пользователем вручную.
			Если ПустаяСтрока(ОбъектПресета.ar_ИсточникРасширение) Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			ОбъектПресета = Справочники.ar_Пресеты.СоздатьЭлемент();
		КонецЕсли;

		ОбъектПресета.Наименование = Лев(ИмяПресета, 150);
		ОбъектПресета.ar_Имя = Лев(ИмяПресета, 150);
		ОбъектПресета.ar_JSON = ТекстJSON;
		ОбъектПресета.ar_ИсточникРасширение = ИмяРасширения;

		Категория = Данные.Получить("category");
		ОбъектПресета.ar_Категория = ?(Категория = Неопределено, "", Лев(СокрЛП(Строка(Категория)), 100));

		Автор = Данные.Получить("author");
		ОбъектПресета.ar_Автор = ?(Автор = Неопределено, ИмяРасширения, Лев(СокрЛП(Строка(Автор)), 150));

		ВерсияПресета = Данные.Получить("version");
		ОбъектПресета.ar_Версия = ?(ВерсияПресета = Неопределено, "1.0.0", Лев(СокрЛП(Строка(ВерсияПресета)), 20));

		Попытка
			ОбъектПресета.Записать();
		Исключение
			// Нет прав на запись справочника - библиотека всё равно должна
			// открыться и показать то, что уже есть.
			Продолжить;
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

// Находит элемент ar_Пресеты по реквизиту ar_Имя.
//
// Параметры:
//   ИмяПресета - Строка - значение реквизита ar_Имя.
//
// Возвращаемое значение:
//   СправочникСсылка.ar_Пресеты либо Неопределено.
//
&НаСервереБезКонтекста
Функция НайтиПресетПоИмени(Знач ИмяПресета)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	п.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ar_Пресеты КАК п
		|ГДЕ
		|	п.ar_Имя = &ИмяПресета";
	Запрос.УстановитьПараметр("ИмяПресета", ИмяПресета);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Загружает полную таблицу пресетов из БД на сервер.
// Заполняет ТаблицаПресетовПолная и ТаблицаПресетов.
//
&НаСервере
Процедура ЗагрузитьТаблицуПресетов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	п.Ссылка             КАК Ссылка,
	|	п.ar_Имя            КАК Имя,
	|	п.ar_Категория      КАК Категория,
	|	п.ar_Автор          КАК Автор,
	|	п.ar_Версия         КАК Версия,
	|	п.ar_ИконкаИмя      КАК ИконкаИмя,
	|	п.ar_ИсточникРасширение КАК ИсточникРасширение
	|ИЗ
	|	Справочник.ar_Пресеты КАК п
	|ГДЕ
	|	п.ПометкаУдаления = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	п.ar_Категория,
	|	п.ar_Имя";

	Результат = Запрос.Выполнить();

	ТаблицаПресетовПолная.Очистить();
	ТаблицаПресетов.Очистить();

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПресетовПолная.Добавить();
		НоваяСтрока.Ссылка             = Выборка.Ссылка;
		НоваяСтрока.Имя                = Выборка.Имя;
		НоваяСтрока.Категория          = Выборка.Категория;
		НоваяСтрока.Автор              = Выборка.Автор;
		НоваяСтрока.Версия             = Выборка.Версия;
		НоваяСтрока.ИконкаИмя         = Выборка.ИконкаИмя;
		НоваяСтрока.ИсточникРасширение = Выборка.ИсточникРасширение;
		НоваяСтрока.ОписаниеJSON       = "";
	КонецЦикла;

	// Копируем в отображаемую таблицу
	СкопироватьСтрокиТаблицы(ТаблицаПресетовПолная, ТаблицаПресетов);
	ОбновитьВидимостьДекорации();

КонецПроцедуры

// Заполняет список уникальных категорий для выпадающего списка фильтра.
//
&НаСервере
Процедура ЗаполнитьСписокКатегорий()

	Элементы.ФильтрКатегорияЭлемент.СписокВыбора.Очистить();
	Элементы.ФильтрКатегорияЭлемент.СписокВыбора.Добавить("",
		НСтр("ru = 'Все'; en = 'All'"));

	Категории = Новый Соответствие;
	Для Каждого Стр Из ТаблицаПресетовПолная Цикл
		Если НЕ ПустаяСтрока(Стр.Категория) И Категории[Стр.Категория] = Неопределено Тогда
			Категории[Стр.Категория] = Истина;
			Элементы.ФильтрКатегорияЭлемент.СписокВыбора.Добавить(Стр.Категория, Стр.Категория);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Применяет текущие значения фильтров к таблице пресетов.
// Вызывается с сервера при изменении любого фильтра.
//
&НаСервере
Процедура ПрименитьФильтрНаСервере()

	ТекстПоиска = НРег(СокрЛП(ФильтрПоиск));
	КатегорияФильтра = ФильтрКатегория;
	ТолькоЯдро = ФильтрТолькоЯдро;

	ТаблицаПресетов.Очистить();

	Для Каждого Стр Из ТаблицаПресетовПолная Цикл

		// Фильтр по тексту (substring, case-insensitive)
		Если НЕ ПустаяСтрока(ТекстПоиска)
			И СтрНайти(НРег(Стр.Имя), ТекстПоиска) = 0 Тогда
			Продолжить;
		КонецЕсли;

		// Фильтр по категории
		Если НЕ ПустаяСтрока(КатегорияФильтра)
			И Стр.Категория <> КатегорияФильтра Тогда
			Продолжить;
		КонецЕсли;

		// Фильтр "только ядро": ИсточникРасширение = ""
		Если ТолькоЯдро И НЕ ПустаяСтрока(Стр.ИсточникРасширение) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаПресетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;

	ОбновитьВидимостьДекорации();

КонецПроцедуры

// Обновляет таблицу пресетов с повторной загрузкой из БД.
//
&НаСервере
Процедура ОбновитьСписокНаСервере()
	ЗагрузитьТаблицуПресетов();
	ЗаполнитьСписокКатегорий();
	ПрименитьФильтрНаСервере();
КонецПроцедуры

// Вызывает импорт пресета на сервере и возвращает результат клиенту.
//
// Параметры:
//   СсылкаПресет - СправочникСсылка.ar_Пресеты
//
// Возвращаемое значение:
//   Структура - результат импорта от ar_ПресетыИмпорт
//
&НаСервереБезКонтекста
Функция ИмпортироватьПресетНаСервере(Знач СсылкаПресет)
	Возврат ar_ПресетыИмпорт.ИмпортироватьПресет(СсылкаПресет);
КонецФункции

// Проверяет право на создание/изменение агентов (Метаданные доступны только на сервере).
//
// Возвращаемое значение:
//   Булево
//
&НаСервереБезКонтекста
Функция ЕстьПравоСозданияАгентаНаСервере()
	// Права проверяются раздельно: составного права "ДобавлениеИзменение" в
	// платформе не существует - обращение к нему бросает "Указанное право не
	// существует" и импорт падал вместо создания агента.
	Возврат ПравоДоступа("Добавление", Метаданные.Справочники.ar_Агенты)
		И ПравоДоступа("Изменение", Метаданные.Справочники.ar_Агенты);
КонецФункции

// Обрабатывает результат импорта пресета: показывает сообщения пользователю.
//
// Параметры:
//   РезультатИмпорта - Структура - результат от ar_ПресетыИмпорт.ИмпортироватьПресет
//
&НаКлиенте
Процедура ОбработатьРезультатИмпорта(Знач РезультатИмпорта)

	Если НЕ РезультатИмпорта.Успех Тогда
		// Показываем читаемое сообщение об ошибке
		ТекстОшибки = ТекстОписанияОшибкиИмпорта(РезультатИмпорта.Причина);
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;

	// Успех: уведомляем и предлагаем открыть
	ИмяАгента = Строка(РезультатИмпорта.АгентСсылка);
	// Сигнатура: (Текст, НавигационнаяСсылка, Пояснение, Картинка, Статус, ...).
	// Статус - ПЯТЫЙ параметр: передача его четвёртым (на месте Картинки) давала
	// "Несоответствие типов (параметр номер '4')" и роняла импорт уже ПОСЛЕ
	// создания агента - агент создавался, но пользователь видел только ошибку.
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Агент создан'; en = 'Agent created'"),
		ПолучитьНавигационнуюСсылку(РезультатИмпорта.АгентСсылка),
		ИмяАгента,
		,
		СтатусОповещенияПользователя.Информация);

	// Предупреждения о ненайденных элементах
	СообщенияПредупреждений = Новый Массив;

	Если РезультатИмпорта.НеНайденПровайдер Тогда
		СообщенияПредупреждений.Добавить(
			НСтр("ru = 'LLM-провайдер ""'; en = 'LLM provider ""'")
			+ РезультатИмпорта.ИмяПровайдераПресет
			+ НСтр("ru = '"" не найден в базе. Настройте провайдера вручную на вкладке LLM агента.';
			       |en = '"" not found. Set up the provider manually on the LLM tab of the agent.'"));
	КонецЕсли;

	Если РезультатИмпорта.НеНайденныеTools.Количество() > 0 Тогда
		СообщенияПредупреждений.Добавить(
			НСтр("ru = 'Не найдены tools: '; en = 'Tools not found: '")
			+ СтрСоединить(РезультатИмпорта.НеНайденныеTools, ", ")
			+ НСтр("ru = '. Добавьте их в реестр Tools.'; en = '. Add them to the Tools registry.'"));
	КонецЕсли;

	Если РезультатИмпорта.НеНайденныеSkills.Количество() > 0 Тогда
		СообщенияПредупреждений.Добавить(
			НСтр("ru = 'Не найдены skills: '; en = 'Skills not found: '")
			+ СтрСоединить(РезультатИмпорта.НеНайденныеSkills, ", "));
	КонецЕсли;

	// Предупреждения о ключах пресета, не примененных из-за неверного
	// типа/значения (тексты уже локализованы в ar_ПресетыИмпорт)
	Для Каждого ТекстПредупреждения Из РезультатИмпорта.Предупреждения Цикл
		СообщенияПредупреждений.Добавить(ТекстПредупреждения);
	КонецЦикла;

	Если СообщенияПредупреждений.Количество() > 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(СообщенияПредупреждений, Символы.ПС));
	КонецЕсли;

КонецПроцедуры

// Возвращает человекочитаемый текст ошибки по коду причины.
//
// Параметры:
//   Причина - Строка - код ошибки
//
// Возвращаемое значение:
//   Строка
//
&НаКлиенте
Функция ТекстОписанияОшибкиИмпорта(Знач Причина)

	Если Причина = "invalid_json" Тогда
		Возврат НСтр("ru = 'Пресет содержит некорректный JSON.'; en = 'The preset contains invalid JSON.'");
	ИначеЕсли Причина = "wrong_kind" Тогда
		Возврат НСтр("ru = 'Тип пресета не соответствует ""agent_preset"". Возможно, это пресет tools (UI-04).';
		             |en = 'Preset type is not ""agent_preset"". This may be a tools preset (UI-04).'");
	ИначеЕсли Причина = "unsupported_version" Тогда
		Возврат НСтр("ru = 'Версия пресета не поддерживается этой версией AgentRunner. Обновите расширение.';
		             |en = 'Preset version is not supported by this version of AgentRunner. Update the extension.'");
	ИначеЕсли Причина = "access_denied" Тогда
		Возврат НСтр("ru = 'Недостаточно прав для создания агента. Обратитесь к администратору.';
		             |en = 'Insufficient rights to create an agent. Contact the administrator.'");
	Иначе
		Возврат НСтр("ru = 'Ошибка импорта пресета. Подробности см. в журнале регистрации.';
		             |en = 'Preset import error. See the event log for details.'");
	КонецЕсли;

КонецФункции

// Возвращает ссылку выбранного в таблице пресета или Неопределено.
//
// Возвращаемое значение:
//   СправочникСсылка.ar_Пресеты или Неопределено
//
&НаКлиенте
Функция СсылкаВыбранногоПресета()

	ТекущиеДанные = Элементы.ТаблицаПресетовЭлемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ТекущиеДанные.Ссылка;

КонецФункции

// Устанавливает доступность кнопок "Импортировать" и "Открыть карточку".
//
// Параметры:
//   Доступна - Булево
//
&НаКлиенте
Процедура УстановитьДоступностьКнопок(Знач Доступна)

	Элементы.КнопкаИмпорт.Доступность  = Доступна;
	Элементы.КнопкаОткрыть.Доступность = Доступна;

КонецПроцедуры

// Обновляет видимость декорации "Пресеты не найдены".
//
&НаСервере
Процедура ОбновитьВидимостьДекорации()
	Элементы.ДекорацияПусто.Видимость = (ТаблицаПресетов.Количество() = 0);
КонецПроцедуры

// Копирует строки из исходной таблицы значений в целевую.
//
// Параметры:
//   Источник - ТаблицаЗначений
//   Цель     - ТаблицаЗначений (реквизит формы)
//
&НаСервере
Процедура СкопироватьСтрокиТаблицы(Знач Источник, Цель)
	Цель.Очистить();
	Для Каждого Стр Из Источник Цикл
		НоваяСтрока = Цель.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
